# Ejercicios Pair Programming - Módulo 2 Sprint 2
## Lección 4 - ETL 3.1
### Natalia García Lago y Noemi Azorín

In [60]:
import pandas as pd
import mysql.connector
pd.options.display.max_columns = None

In [61]:
df = pd.read_csv('../ficheros/attacks_limpieza_completa.csv', index_col=0)
df.head(2)

,year,type,country,age,species_,fecha_limpia,fatal,sex,latitud,longitud,country2,fatal_N,fatal_Unknown,fatal_Y,fatal_N.1,fatal_Unknown.1,fatal_Y.1,species_.1,fecha_limpia.1,type.1,age_NORM
0,2018,Boating,usa,57.0,White shark,Jun,N,F,39.78373,-100.445882,HN,1,0,0,1,0,0,4,7,1,9.116327
1,2018,Unprovoked,usa,11.0,Unespecific,Jun,N,F,39.78373,-100.445882,HN,1,0,0,1,0,0,3,7,7,3.804860


Es el momento de meter todos nuestros datos en SQL 💪🏽!!! En este ejercicio nos crearemos dos tablas en una BBDD creada por nosotras. Una de las tablas contendrá la información que obtuvimos de los ejercicios de pair programming de Limpieza, es decir, el data set de ataques de tiburones limpito. La segunda tabla tendrá la información obtenida en el ejercicio de pair de ETL 1.

📌 Nota Todo lo tendremos que hacer desde jupyter notebook

- Cread la BBDD con el nombre de tiburones.
- Cread las tablas de la BBDD: tabla ataques, tabla clima

🚨 En caso de que no tengáis los datos unidos de la sesión anterior, tenéis un csv datos_union_clima_ataques con todos los datos que necesitareis para este ejercicio

In [62]:
#creamos la bbdd 

def crear_bbdd(nombre_bbdd):
    
    mydb = mysql.connector.connect(
      host="localhost",
      user="root",
      password='AlumnaAdalab' 
    )
    print("Conexión realizada con éxito")
    
    mycursor = mydb.cursor()

    try:
        mycursor.execute(f"CREATE DATABASE IF NOT EXISTS {nombre_bbdd};")
        print(mycursor)
    except mysql.connector.Error as err:
        print(err)
        print("Error Code:", err.errno)
        print("SQLSTATE", err.sqlstate)
        print("Message", err.msg)

In [63]:
bbdd_ataques= crear_bbdd("tiburones")

Conexión realizada con éxito
MySQLCursor: CREATE DATABASE IF NOT EXISTS tiburones;

In [64]:
#creamos la función para la inserción de las tablas

def insertar_tabla(nombre_bbdd, contraseña, query):
    
   
    cnx = mysql.connector.connect(user='root', password=f"{contraseña}",
                                     host='127.0.0.1', database=f"{nombre_bbdd}")
   
    mycursor = cnx.cursor()
    
  
    try: 
        mycursor.execute(query)
        cnx.commit() 
  
    except mysql.connector.Error as err:
        print(err)
        print("Error Code:", err.errno)
        print("SQLSTATE", err.sqlstate)
        print("Message", err.msg)

In [65]:
#creamos la tabla ataques

tabla_ataques = '''CREATE TABLE IF NOT EXISTS `tiburones`.`ataques` (
  `year` INT NOT NULL,
  `type` VARCHAR(250),
  `country` VARCHAR(250),
  `age` FLOAT,
  `species_` VARCHAR(250),
  `fecha_limpia` VARCHAR(250),
  `fatal` VARCHAR(50),
  `sex` VARCHAR(250))
ENGINE = InnoDB; '''

In [66]:
#creamos la tabla clima

tabla_clima = ''' CREATE TABLE IF NOT EXISTS `tiburones`.`clima` (
   `latitud` FLOAT,
    `longitud` FLOAT,
    `country2` VARCHAR(250),
    `fatal_N` INT,
    `fatal_Unknown` INT,
    `fatal_Y` INT, 
    `fatal_N.1` INT,
    `fatal_Unknown.1` INT,
    `fatal_Y.1` INT,
    `species_.1` INT,
    `fecha_limpia.1` INT,
    `type.1` INT,
    `age_NORM` FLOAT )
 ENGINE = InnoDB ;'''

In [67]:
insertar_tabla("tiburones", 'AlumnaAdalab', tabla_ataques)

In [68]:
insertar_tabla("tiburones", 'AlumnaAdalab', tabla_clima)

BONUS Insertar los datos en las tablas.

📌 Nota Esta parte del pair es optativa y no será considerada para la evaluación.

In [69]:
#insertamos los datos en la tabla ataques

for indice, fila in df.iterrows(): 
    
    
    query_ataques = f""" INSERT INTO `ataques` (`year`,`type`, `country`, `age`, `species_`, `fecha_limpia`, `fatal`, `sex`)         
            VALUES ("{fila['year']}", "{fila['type']}", "{fila['country']}", "{fila['age']}","{fila['species_']}", "{fila['fecha_limpia']}","{fila['fatal']}", "{fila['sex']}");
            """
    
    insertar_tabla("tiburones", 'AlumnaAdalab', query_ataques)

In [70]:
#insertamos los datos de dos columnas en la tabla clima

for indice, fila in df.iterrows(): 
    
    
    query_clima = f""" INSERT INTO `clima` (`latitud`, `longitud`)         
            VALUES ( "{fila['latitud']}", "{fila['longitud']}");
            """
    
    insertar_tabla("tiburones", 'AlumnaAdalab', query_clima)

1265 (01000): Data truncated for column 'latitud' at row 1
Error Code: 1265
SQLSTATE 01000
Message Data truncated for column 'latitud' at row 1
1265 (01000): Data truncated for column 'latitud' at row 1
Error Code: 1265
SQLSTATE 01000
Message Data truncated for column 'latitud' at row 1
1265 (01000): Data truncated for column 'latitud' at row 1
Error Code: 1265
SQLSTATE 01000
Message Data truncated for column 'latitud' at row 1
1265 (01000): Data truncated for column 'latitud' at row 1
Error Code: 1265
SQLSTATE 01000
Message Data truncated for column 'latitud' at row 1
1265 (01000): Data truncated for column 'latitud' at row 1
Error Code: 1265
SQLSTATE 01000
Message Data truncated for column 'latitud' at row 1
1265 (01000): Data truncated for column 'latitud' at row 1
Error Code: 1265
SQLSTATE 01000
Message Data truncated for column 'latitud' at row 1
1265 (01000): Data truncated for column 'latitud' at row 1
Error Code: 1265
SQLSTATE 01000
Message Data truncated for column 'latitud' at row 1
1265 (01000): Data truncated for column 'latitud' at row 1
Error Code: 1265
SQLSTATE 01000
Message Data truncated for column 'latitud' at row 1
1265 (01000): Data truncated for column 'latitud' at row 1
Error Code: 1265
SQLSTATE 01000
Message Data truncated for column 'latitud' at row 1
1265 (01000): Data truncated for column 'latitud' at row 1
Error Code: 1265
SQLSTATE 01000
Message Data truncated for column 'latitud' at row 1
1265 (01000): Data truncated for column 'latitud' at row 1
Error Code: 1265
SQLSTATE 01000
Message Data truncated for column 'latitud' at row 1
1265 (01000): Data truncated for column 'latitud' at row 1
Error Code: 1265
SQLSTATE 01000
Message Data truncated for column 'latitud' at row 1
1265 (01000): Data truncated for column 'latitud' at row 1
Error Code: 1265
SQLSTATE 01000
Message Data truncated for column 'latitud' at row 1
1265 (01000): Data truncated for column 'latitud' at row 1
Error Code: 1265
SQLSTATE 01000
Message Data truncated for column 'latitud' at row 1